
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ЭтоНовый() Тогда
		Автор = Пользователи.АвторизованныйПользователь();  
		Если ДанныеЗаполнения  <> Неопределено И  ДанныеЗаполнения.Свойство("Сотрудник") Тогда
			Сотрудник = ДанныеЗаполнения.Сотрудник; 	
		КонецЕсли;  
		ТипЗаписиКалендаря = Перечисления.ТипЗаписиКалендаря.ПустоеЗначение;
			
		 
		
        Состояние = Перечисления.СостояниеЗаписиРабочегоКалендаря.ВРаботе;
	КонецЕсли;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		
		//Если ДанныеЗаполнения.Свойство("ЗаписьКалендаря") И ЗначениеЗаполнено(ДанныеЗаполнения.ЗаписьКалендаря) Тогда
		//	СкопироватьЗаписьКалендаря(ДанныеЗаполнения.ЗаписьКалендаря);
		//КонецЕсли;
		
		Если ДанныеЗаполнения.Свойство("Предмет") И   ТипЗнч(ДанныеЗаполнения.Предмет) = Тип("ДокументСсылка.Центр_Задача") Тогда
				ТипЗаписиКалендаря = Перечисления.ТипЗаписиКалендаря.Задача; 
				Предмет = ДанныеЗаполнения.Предмет;
				Описание = "Что то из задачи";				
		КонецЕсли;
			
				
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
		
						
	КонецЕсли;
	
		
	Центр_КаленарьКлиентСервер.СкорректироватьДатуНачалаИОкончания(ДатаНачала, ДатаОкончания, ВесьДень);
	
КонецПроцедуры
