#Область ПрограммныйИнтерфейс
//Получение цвета из строки RGB
// Параметры:
//	СтрокаЦветаRGB - Строка - строка с описанием RGB цвета
// Возвращаемое значение:
//	Цвет
Функция ЦветПоСтрокеRGB(СтрокаЦветаRGB) Экспорт
	
	МассивЧастейЦвета = СтрРазделить(СтрокаЦветаRGB, ",");   
	Если МассивЧастейЦвета.Количество() = 3 Тогда
		//@skip-check new-color
		Возврат Новый Цвет(МассивЧастейЦвета[0], МассивЧастейЦвета[1], МассивЧастейЦвета[2]);
	КонецЕсли; 
	
	Возврат Новый Цвет;
	
КонецФункции  

//Получение общего макета по имени
// Параметры:
//	ИмяМакета - Строка - имя макета
// Возвращаемое значение:
//	ТабличныйДокумент - ТекстовыйДокумент 
Функция ТекстОбщегоМакета(ИмяМакета) Экспорт

	Возврат ПолучитьОбщийМакет(ИмяМакета).ПолучитьТекст();	
	
КонецФункции
#КонецОбласти
