#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Доска") Тогда
        Если ЗначениеЗаполнено(Параметры.Доска) Тогда
            Доска=Параметры.Доска;   
        КонецЕсли; 
	КонецЕсли;
	
	Если Параметры.Свойство("Номер") Тогда
        Если ЗначениеЗаполнено(Параметры.Номер) Тогда
            Номер=Параметры.Номер;   
        КонецЕсли; 
	КонецЕсли;
	
	
	
	Если Параметры.Свойство("Наименование") Тогда
        Если ЗначениеЗаполнено(Параметры.Наименование) Тогда
            Наименование = Параметры.Наименование;   
        КонецЕсли; 
	КонецЕсли;
КонецПроцедуры




&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры
#КонецОбласти

#Область  ОбработчикиКомандФормы

&НаКлиенте
Процедура СохранитьПоУмолчанию(Команда)
	Если ЗначениеЗаполнено(Наименование) Тогда
		СохранитьПоУмолчаниюНаСервере();
		ЭтотОбъект.Закрыть();
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю("Введите наименование");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьКонструктор(Команда)
	ЭтотОбъект.Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)	
	Если ЗначениеЗаполнено(Наименование) Тогда
		СохранитьНаСервере();
		ЭтотОбъект.Закрыть();
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю("Введите наименование");
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СохранитьПоУмолчаниюНаСервере()
	Набор = РегистрыСведений.Центр_НастройкиПользователейКолонокКанБан.СоздатьНаборЗаписей();
	Набор.Отбор.Пользователь.Установить(ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка"));
	Набор.Отбор.Доска.Установить(Доска);
	Набор.Отбор.Номер.Установить(Номер);
	Набор.Прочитать();
	
	Если Набор.Количество() Тогда
		Запись = Набор[0];
		Запись.Наименование = Наименование;
		Запись.НастройкиКолонки = Новый ХранилищеЗначения(Колонка.КомпоновщикНастроек.ПолучитьНастройки());
	иначе
		Запись = Набор.Добавить();
		Запись.Пользователь = ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка");
		Запись.Доска = Доска;
		Запись.Номер = Номер;
		Запись.Наименование = Наименование;
		Запись.НастройкиКолонки = Новый ХранилищеЗначения(Колонка.КомпоновщикНастроек.ПолучитьНастройки());
	КонецЕсли;
	Набор.Записать();
КонецПроцедуры


&НаСервере
Процедура СохранитьНаСервере()
	Набор = РегистрыСведений.Центр_НастройкиПользователейКолонокКанБан.СоздатьНаборЗаписей();
	Набор.Отбор.Пользователь.Установить(Пользователи.АвторизованныйПользователь());
	Набор.Отбор.Доска.Установить(Доска);
	Набор.Отбор.Номер.Установить(Номер);
	Набор.Прочитать();
	Если Набор.Количество() Тогда
		Запись = Набор[0];
		Запись.НастройкиКолонки = Новый ХранилищеЗначения(Колонка.КомпоновщикНастроек.ПолучитьНастройки());
		Запись.Наименование = Наименование;
	иначе
		Запись = Набор.Добавить();
		Запись.Пользователь = Пользователи.АвторизованныйПользователь();
		Запись.Доска = Доска;
		Запись.Номер = Номер;
		Запись.Наименование = Наименование;
		Запись.НастройкиКолонки = Новый ХранилищеЗначения(Колонка.КомпоновщикНастроек.ПолучитьНастройки());
	КонецЕсли;
	Набор.Записать();
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	Настройки = Параметры.НастройкиКолонки.ПолучитьНастройки();
	Колонка.КомпоновщикНастроек.ЗагрузитьНастройки(Настройки);
КонецПроцедуры
#КонецОбласти
