
Процедура Центр_ПроверкаВыполненияЭтаповКонтроля() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Центр_КонтрольНадЭтапамиЗадач.Запрос,
		|	Центр_КонтрольНадЭтапамиЗадач.Ссылка
		|ИЗ
		|	Справочник.Центр_КонтрольНадЭтапамиЗадач КАК Центр_КонтрольНадЭтапамиЗадач";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();

	Пока Выборка.Следующий() Цикл
		Попытка
			 ВыполнениеЗапросаИзСправочника(Выборка.Запрос, Выборка.Ссылка);		
		Исключение
			ОбщегоНазначения.СообщитьПользователю("Ошибка Выполнения");
		КонецПопытки;
	КонецЦикла;

КонецПроцедуры

Процедура ВыполнениеЗапросаИзСправочника(ТекстЗапроса, Этап)
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Набор = РегистрыСведений.Центр_ПросроченныеДействияПоЗадачам.СоздатьНаборЗаписей();
		Набор.Отбор.Задача.Установить(Выборка.Ссылка);
		Набор.Отбор.Этап.Установить(Этап);
		Набор.Прочитать();
		Если Не Набор.Количество() Тогда
			Запись = Набор.Добавить();
			Запись.Задача = Выборка.Ссылка;
			Запись.Этап = Этап;
			Запись.Период = ТекущаяДатаСеанса();
		КонецЕсли;
		Набор.Записать();
	КонецЦикла;
КонецПроцедуры