
#Область  ПрограммныйИнтерфейс
Процедура Центр_ПроверкаВыполненияЭтаповКонтроля() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Центр_КонтрольНадЭтапамиЗадач.Запрос КАК Запрос,
		|	Центр_КонтрольНадЭтапамиЗадач.Ссылка КАК Ссылка,
		|	Центр_КонтрольНадЭтапамиЗадачПараметры.Параметр,
		|	Центр_КонтрольНадЭтапамиЗадачПараметры.Значение
		|ИЗ
		|	Справочник.Центр_КонтрольНадЭтапамиЗадач КАК Центр_КонтрольНадЭтапамиЗадач
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Центр_КонтрольНадЭтапамиЗадач.Параметры КАК Центр_КонтрольНадЭтапамиЗадачПараметры
		|		ПО Центр_КонтрольНадЭтапамиЗадач.Ссылка = Центр_КонтрольНадЭтапамиЗадачПараметры.Ссылка
		|ИТОГИ
		|	МАКСИМУМ(Запрос)
		|ПО
		|	Ссылка";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ОчиститьРегистрСведенийКонтроля();
	Пока Выборка.Следующий() Цикл
		Попытка
			 ВыполнениеЗапросаИзСправочника(Выборка);		
		Исключение
			ОбщегоНазначения.СообщитьПользователю("Ошибка Выполнения");
		КонецПопытки;
	КонецЦикла;

КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
Процедура ОчиститьРегистрСведенийКонтроля()
	Набор = РегистрыСведений.Центр_ПросроченныеДействияПоЗадачам.СоздатьНаборЗаписей();
	Набор.Прочитать();
	Набор.Очистить();
	Набор.Записать();
КонецПроцедуры

Процедура ВыполнениеЗапросаИзСправочника(СправочникКонтроля)
	Запрос = Новый Запрос;
	Запрос.Текст = СправочникКонтроля.Запрос;
	ВыборкаПараметровКонтроля = СправочникКонтроля.Выбрать();
	Пока ВыборкаПараметровКонтроля.Следующий() Цикл
		Запрос.УстановитьПараметр(ВыборкаПараметровКонтроля.Параметр, ВыборкаПараметровКонтроля.Значение);
	КонецЦикла;
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Запись = РегистрыСведений.Центр_ПросроченныеДействияПоЗадачам.СоздатьМенеджерЗаписи();
		Запись.Задача = Выборка.Ссылка;
		Запись.Пользователь = Выборка.Пользователь;
		Запись.Этап = СправочникКонтроля.Ссылка;
		Запись.Записать();
	КонецЦикла;
КонецПроцедуры
#КонецОбласти