#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура Конструктор(Команда)
	Конструктор = Новый КонструкторЗапроса;

	Конструктор.Текст = Объект.Запрос;

	Оповещение = Новый ОписаниеОповещения("ОткрытьКонструкторЗапросаЗавершение", ЭтотОбъект);

	Конструктор.Показать(Оповещение);

КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаКлиенте
Процедура ОткрытьКонструкторЗапросаЗавершение(Текст, ДополнительныеПараметры) Экспорт
	Если Не Текст = Неопределено Тогда
		Объект.Запрос = Текст;	
	КонецЕсли;
КонецПроцедуры
#КонецОбласти