
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если ПараметрКоманды = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("Подразделение, УникальныйИдентификаторФормыПодразделения", 
		ПараметрКоманды,
		ПараметрыВыполненияКоманды.Источник.УникальныйИдентификатор);
	ОткрытьФорму("Справочник.Сотрудники.Форма.ФормаСотрудниковПодразделения", 
		ПараметрыФормы,
		ПараметрыВыполненияКоманды.Источник,
		ПараметрыВыполненияКоманды.Уникальность,
		ПараметрыВыполненияКоманды.Окно);
	
КонецПроцедуры
