#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции
Процедура СоздатьЗаписьСогласования(Задача, Согласующий, Дедлайн, КомментарийОценки, 
	ПричинаПереноса = Неопределено) Экспорт
	МенеджерЗаписи = СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Задача = Задача;
	МенеджерЗаписи.КомментарийОценки = КомментарийОценки;
	МенеджерЗаписи.Период = ТекущаяДатаСеанса();
	МенеджерЗаписи.Согласующий = Согласующий;
	МенеджерЗаписи.Согласовант = Пользователи.ТекущийПользователь();
	МенеджерЗаписи.Дедлайн = Дедлайн;
	Если ПричинаПереноса <> Неопределено Тогда
		МенеджерЗаписи.ПричинаПереноса = ПричинаПереноса;
	КонецЕсли;
	МенеджерЗаписи.Записать();
КонецПроцедуры

Процедура ИзменитьПоследнююЗаписьПоЗадаче(Задача, Отказ, Согласовано, КомментарийОтказа = Неопределено) Экспорт
	Набор = СоздатьНаборЗаписей();
	Набор.Отбор.Задача.Установить(Задача);
	Набор.Прочитать();
	Запись = Набор[Набор.Количество() - 1];
	Запись.Согласовано = Согласовано;
	Запись.Отказ = Отказ;
	Если КомментарийОтказа <> Неопределено Тогда
		Запись.КомментарийОтказа = КомментарийОтказа;
	КонецЕсли;
	Набор.Записать();
КонецПроцедуры
#КонецОбласти
#КонецЕсли