#Область СлужебныеПроцедурыИФункции

Процедура ТриггерСозданиеЗадачи(ЗадачаОбъект) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Центр_СтатусыЗадачСрезПоследних.Статус КАК Статус
		|ИЗ
		|	РегистрСведений.Центр_СтатусыЗадач.СрезПоследних(, Задача = &Задача) КАК Центр_СтатусыЗадачСрезПоследних";

	Запрос.УстановитьПараметр("Задача", ЗадачаОбъект);
	
	ВыборкаСтатусЗадачи = Запрос.Выполнить().Выбрать();
	
	Если Не ВыборкаСтатусЗадачи.Следующий() Тогда
		ЗапросСправочник = Новый Запрос;
		ЗапросСправочник.Текст =
		"ВЫБРАТЬ
		|	Центр_ТриггерыПереходыСтатусов.СтатусЗавершения КАК Статус,
		|	Центр_ТриггерыПереходыСтатусов.СтатусСрабатывания
		|ИЗ
		|	Справочник.Центр_Триггеры.ПереходыСтатусов КАК Центр_ТриггерыПереходыСтатусов
		|ГДЕ
		|	Центр_ТриггерыПереходыСтатусов.Ссылка = &Ссылка
		|СГРУППИРОВАТЬ ПО
		|	Центр_ТриггерыПереходыСтатусов.СтатусЗавершения,
		|	Центр_ТриггерыПереходыСтатусов.СтатусСрабатывания";
		
		ЗапросСправочник.УстановитьПараметр("Ссылка", Справочники.Центр_Триггеры.СозданиеЗадачи);
		Выборка = ЗапросСправочник.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			МенеджерЗаписи = РегистрыСведений.Центр_СтатусыЗадач.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Период = ТекущаяДатаСеанса();
			МенеджерЗаписи.Задача = ЗадачаОбъект;
			МенеджерЗаписи.Статус = Выборка.Статус;
			МенеджерЗаписи.Записать();
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Процедура ТриггерПросмотрИсполнителем(ЗадачаОбъект) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Центр_ТриггерыПереходыСтатусов.СтатусСрабатывания,
		|	Центр_ТриггерыПереходыСтатусов.СтатусЗавершения
		|ПОМЕСТИТЬ вт_СтатусыТриггера
		|ИЗ
		|	Справочник.Центр_Триггеры.ПереходыСтатусов КАК Центр_ТриггерыПереходыСтатусов
		|ГДЕ
		|	Центр_ТриггерыПереходыСтатусов.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт_СтатусыТриггера.СтатусЗавершения,
		|	Центр_ИсполнителиЗадачСрезПоследних.Исполнитель
		|ИЗ
		|	РегистрСведений.Центр_СтатусыЗадач.СрезПоследних(, Задача = &Задача) КАК Центр_СтатусыЗадачСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ вт_СтатусыТриггера КАК вт_СтатусыТриггера
		|		ПО Центр_СтатусыЗадачСрезПоследних.Статус = вт_СтатусыТриггера.СтатусСрабатывания
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Центр_ИсполнителиЗадач.СрезПоследних(, Задача = &Задача
		|		И Исполнитель = &ТекущийПользователь) КАК Центр_ИсполнителиЗадачСрезПоследних
		|		ПО Центр_ИсполнителиЗадачСрезПоследних.Задача = Центр_СтатусыЗадачСрезПоследних.Задача";
	
	Запрос.УстановитьПараметр("Ссылка", Справочники.Центр_Триггеры.ОзнакомлениеИсполнителя);
	Запрос.УстановитьПараметр("Задача", ЗадачаОбъект);
	Запрос.УстановитьПараметр("ТекущийПользователь", Пользователи.АвторизованныйПользователь());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.Исполнитель) И ЗначениеЗаполнено(Выборка.СтатусЗавершения) Тогда
		МенеджерЗаписи = РегистрыСведений.Центр_СтатусыЗадач.СоздатьМенеджерЗаписи();
        МенеджерЗаписи.Период = ТекущаяДатаСеанса();
        МенеджерЗаписи.Задача = ЗадачаОбъект;
        МенеджерЗаписи.Статус = Выборка.СтатусЗавершения;
        МенеджерЗаписи.Записать();
	КонецЕсли;

КонецПроцедуры


Процедура ТриггерВзятиеЗадачи(Задача) Экспорт
    Запрос = Новый Запрос;
    Запрос.Текст = "ВЫБРАТЬ
                 |    Центр_СтатусыЗадачСрезПоследних.Статус
                 |ПОМЕСТИТЬ вт_ТекущийСтатус
                 |ИЗ
                 |    РегистрСведений.Центр_СтатусыЗадач.СрезПоследних КАК Центр_СтатусыЗадачСрезПоследних
                 |ГДЕ
                 |    Центр_СтатусыЗадачСрезПоследних.Задача = &Задача
                 |;
                 |
                 |////////////////////////////////////////////////////////////////////////////////
                 |ВЫБРАТЬ
                 |    Центр_ТриггерыПереходыСтатусов.СтатусЗавершения как Статус
                 |ИЗ
                 |    вт_ТекущийСтатус КАК вт_ТекущийСтатус
                 |        ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Центр_Триггеры.ПереходыСтатусов КАК Центр_ТриггерыПереходыСтатусов
                 |        ПО Центр_ТриггерыПереходыСтатусов.Ссылка = &Ссылка
                 |        И вт_ТекущийСтатус.Статус = Центр_ТриггерыПереходыСтатусов.СтатусСрабатывания";
    Запрос.УстановитьПараметр("Задача", Задача);
    Запрос.УстановитьПараметр("Ссылка", ПредопределенноеЗначение("Справочник.Центр_Триггеры.ВзятиеЗадачи"));
    РезультатЗапроса = Запрос.Выполнить();
    Выборка = РезультатЗапроса.Выбрать();

    Пока Выборка.Следующий() Цикл
        МенеджерЗаписи = РегистрыСведений.Центр_СтатусыЗадач.СоздатьМенеджерЗаписи();
        МенеджерЗаписи.Период = ТекущаяДатаСеанса();
        МенеджерЗаписи.Задача = Задача;
        МенеджерЗаписи.Статус = Выборка.Статус;
        МенеджерЗаписи.Записать();
    КонецЦикла;

КонецПроцедуры
#КонецОбласти