#Область СлужебныеПроцедурыИФункции

#Область СозданиеЗадачи

Процедура ТриггерСозданиеЗадачи(ЗадачаОбъект) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Центр_СтатусыЗадачСрезПоследних.Статус КАК Статус
		|ИЗ
		|	РегистрСведений.Центр_СтатусыЗадач.СрезПоследних(, Задача = &Задача) КАК Центр_СтатусыЗадачСрезПоследних";

	Запрос.УстановитьПараметр("Задача", ЗадачаОбъект);
	
	ВыборкаСтатусЗадачи = Запрос.Выполнить().Выбрать();
	
	Если Не ВыборкаСтатусЗадачи.Следующий() Тогда
		ЗапросСправочник = Новый Запрос;
		ЗапросСправочник.Текст =
		"ВЫБРАТЬ
		|	Центр_ТриггерыПереходыСтатусов.СтатусЗавершения КАК Статус,
		|	Центр_ТриггерыПереходыСтатусов.СтатусСрабатывания
		|ИЗ
		|	Справочник.Центр_Триггеры.ПереходыСтатусов КАК Центр_ТриггерыПереходыСтатусов
		|ГДЕ
		|	Центр_ТриггерыПереходыСтатусов.Ссылка = &Ссылка
		|СГРУППИРОВАТЬ ПО
		|	Центр_ТриггерыПереходыСтатусов.СтатусЗавершения,
		|	Центр_ТриггерыПереходыСтатусов.СтатусСрабатывания";
		
		ЗапросСправочник.УстановитьПараметр("Ссылка", Справочники.Центр_Триггеры.СозданиеЗадачи);
		Выборка = ЗапросСправочник.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			МенеджерЗаписи = РегистрыСведений.Центр_СтатусыЗадач.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Период = ТекущаяДатаСеанса();
			МенеджерЗаписи.Задача = ЗадачаОбъект;
			МенеджерЗаписи.Статус = Выборка.Статус;
			МенеджерЗаписи.Записать();
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

Процедура ТриггерПросмотрИсполнителем() Экспорт
	//
КонецПроцедуры
#КонецОбласти