////////////////////////////////////////////////////////////////////////////////
// Модуль для работы с рабочим календарем.
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Принимает приглашение по записям рабочего календаря.
//
// Параметры:
//  ЭлементыЗаписейКалендаря - Массив из Структура - Записи рабочего календаря.
//                                                   См. РаботаСРабочимКалендаремКлиентСервер.НовыйЭлементЗаписиКалендаря().
// 
// Возвращаемое значение:
//  Массив из СправочникСсылка.ЗаписиРабочегоКалендаря - Измененные записи рабочего календаря.
//
Функция ПринятьПриглашение(Знач ЭлементыЗаписейКалендаря) Экспорт
	
	ИзмененныеЗаписиКалендаря = РаботаСРабочимКалендаремСервер.ПринятьПриглашение(ЭлементыЗаписейКалендаря);
	
	Возврат ИзмененныеЗаписиКалендаря;
	
КонецФункции

// Отклоняет приглашение по записям рабочего календаря.
// 
// Параметры:
//  ЭлементыЗаписейКалендаря - Массив из Структура - Записи рабочего календаря.
//                                                   См. РаботаСРабочимКалендаремКлиентСервер.НовыйЭлементЗаписиКалендаря().
// 
// Возвращаемое значение:
//  Массив из СправочникСсылка.ЗаписиРабочегоКалендаря - Измененные записи рабочего календаря.
//
Функция ОтклонитьПриглашение(Знач ЭлементыЗаписейКалендаря) Экспорт
	
	ИзмененныеЗаписиКалендаря = РаботаСРабочимКалендаремСервер.ОтклонитьПриглашение(ЭлементыЗаписейКалендаря);
	
	Возврат ИзмененныеЗаписиКалендаря;
	
КонецФункции

#КонецОбласти