#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не Параметры.Свойство("НастройкаВыбораЗанятости") Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ТаблицаЗанятостьФизЛиц = РеквизитФормыВЗначение("ЗанятостьФизЛиц");
	
	ТаблицаЗанятости = РаботаСРабочимКалендаремСервер.ПолучитьТаблицуЗанятости(
		Сотрудники.ФизЛицаСотрудников(Параметры.НастройкаВыбораЗанятости.Сотрудники),
		Параметры.НастройкаВыбораЗанятости.ДатаНачала,
		Параметры.НастройкаВыбораЗанятости.ДатаОкончания,
		,
		Параметры.НастройкаВыбораЗанятости.ИсключенияЗанятости,
		Истина);
	
	Для Каждого СтрокаЗанятости Из ТаблицаЗанятости Цикл
		НоваяСтрока = ТаблицаЗанятостьФизЛиц.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаЗанятости);
	КонецЦикла;
	
	РаботаСРабочимКалендаремСервер.СортироватьПоСостояниюЗанятости(
		ТаблицаЗанятостьФизЛиц, "Убыв", "ФизическоеЛицо");
	
	ЗначениеВРеквизитФормы(ТаблицаЗанятостьФизЛиц, "ЗанятостьФизЛиц");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьВремя(Команда)
	
	Закрыть(Истина);
	
КонецПроцедуры

#КонецОбласти