
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПРЕДСТАВЛЕНИЕ(Центр_НастройкиПользователейКанБан.Колонка) КАК Колонка,
	|	Центр_НастройкиПользователейКанБан.НастройкиКолонки
	|ИЗ
	|	РегистрСведений.Центр_НастройкиПользователейКанБан КАК Центр_НастройкиПользователейКанБан
	|ГДЕ
	|	Центр_НастройкиПользователейКанБан.Пользователь = &Пользователь";

	Запрос.УстановитьПараметр("Пользователь", Пользователи.АвторизованныйПользователь());

	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Запрос.УстановитьПараметр("Пользователь", ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка"));
		РезультатЗапроса = Запрос.Выполнить();
	КонецЕсли;
	Выборка = РезультатЗапроса.Выбрать();

	ТекстЗапросаДС = "ВЫБРАТЬ
					 |	Центр_Задача.Ссылка,
					 |	Центр_Задача.ВерсияДанных,
					 |	Центр_Задача.ПометкаУдаления,
					 |	Центр_Задача.Номер,
					 |	Центр_Задача.Дата,
					 |	Центр_Задача.Проведен,
					 |	Центр_Задача.Наименование,
					 |	Центр_Задача.ОписаниеЗадачи,
					 |	Центр_Задача.ВидЗадачи,
					 |	Центр_Задача.Постановщик,
					 |	Центр_Задача.Дедлайн,
					 |	Центр_Задача.Длительность,
					 |	Центр_Задача.Приоритет,
					 |	Центр_Задача.Автор,
					 |	Центр_Задача.ГлавнаяЗадача
					 |ИЗ
					 |	Документ.Центр_Задача КАК Центр_Задача";

	Индекс=1;
	КоличествоКолонок = Выборка.Количество();
	СтруктураКолонок = Новый Структура("Ссылка", "Задача");
	
	
	Пока Выборка.Следующий() Цикл
		
		ГруппаКолонки = Центр_ЭлементыФормы.СздГруппаОбычнаяБезОтображения(ЭтотОбъект, "ГруппаКолонки"+Индекс,Элементы.ГруппаОсновногоБлока,1);

		Центр_ЭлементыФормы.СоздатьКоманду(ЭтотОбъект, "НастройкиКолонки"+Индекс, "Настройки",
			"ОткрытьНастройкиДинамическогоСпискаКолонки");
		КонпкаНстроекКолонки = Центр_ЭлементыФормы.СздКнопка(ЭтотОбъект, "НастройкиКолонкиКнопка"+Индекс, ГруппаКолонки,
			"Настройки", "НастройкиКолонки"+Индекс, 1);

		
		СтруктураСвойств = Новый Структура;
		СтруктураСвойств.Вставить("ПоложениеКоманднойПанели", ПоложениеКоманднойПанелиЭлементаФормы.Нет);
		СтруктураСвойств.Вставить("ТолькоПросмотр", Истина);
		СтруктураСвойств.Вставить("Заголовок", Выборка.Колонка);
		ТаблицаДСКолонки = Центр_ЭлементыФормы.СздДинамическийСписок(ЭтотОбъект, "Колонка" + Индекс, ГруппаКолонки,
			ТекстЗапросаДС, , "Документ.Центр_Задача", СтруктураКолонок, СтруктураСвойств, , , );
			
		ЭтотОбъект["Колонка"+Индекс].КомпоновщикНастроек.ЗагрузитьНастройки(Выборка.НастройкиКолонки.Получить());
		Индекс=Индекс+1;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура СохранитьНастройкиОтборов(Команда)
	СохранитьНастройкиОтборовНаСервере();
КонецПроцедуры

#КонецОбласти

//#Область ОбработчикиСобытийЭлементовТаблицыФормы


//#КонецОбласти




#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура НазначитьНастройкиКомпоновщика(Источник)
	НастройкиКомпоновкиДанных = ЭтотОбъект[Источник].КомпоновщикНастроек.ПолучитьИсточникДоступныхНастроек();
	НастройкиКолонки.Инициализировать(НастройкиКомпоновкиДанных);
	
	НастройкиКолонки.ЗагрузитьНастройки(ЭтотОбъект[Источник].КомпоновщикНастроек.ПолучитьНастройки());
КонецПроцедуры	
	
&НаКлиенте
Процедура ОткрытьНастройкиДинамическогоСпискаКолонки(Команда) Экспорт
	ИмяКолонки = "Колонка" + Прав(Команда.Имя, 1);
	НазначитьНастройкиКомпоновщика(ИмяКолонки);
	Элементы.НастройкиКолонкиПользовательскиеНастройки.Обновить();
	Элементы.ГруппаШапка.Показать();
КонецПроцедуры


&НаСервере
Процедура СохранитьНастройкиОтборовНаСервере()
	ЭтотОбъект[ИмяКолонки].КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиКолонки.ПолучитьНастройки());
	НастройкиКолонки.Восстановить();
	ИмяКолонки="";
	Элементы.ГруппаШапка.Скрыть();
КонецПроцедуры
#КонецОбласти