
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Перем ТаблицаДСКолонки;
	ТекстЗапросаДС = "ВЫБРАТЬ
	|	Центр_Задача.Ссылка,
	|	Центр_Задача.ВерсияДанных,
	|	Центр_Задача.ПометкаУдаления,
	|	Центр_Задача.Номер,
	|	Центр_Задача.Дата,
	|	Центр_Задача.Проведен,
	|	Центр_Задача.Наименование,
	|	Центр_Задача.ОписаниеЗадачи,
	|	Центр_Задача.ВидЗадачи,
	|	Центр_Задача.Постановщик,
	|	Центр_Задача.Дедлайн,
	|	Центр_Задача.Длительность,
	|	Центр_Задача.Приоритет,
	|	Центр_Задача.Автор,
	|	Центр_Задача.ГлавнаяЗадача,
	|	Центр_Задача.Наблюдатели.(
	|		Ссылка,
	|		НомерСтроки,
	|		Пользовалель),
	|	Центр_Задача.ЧекЛист.(
	|		Ссылка,
	|		НомерСтроки,
	|		Текст,
	|		Выполнен),
	|	Центр_Задача.Кандидаты.(
	|		Ссылка,
	|		НомерСтроки,
	|		Кандидат),
	|	Центр_Задача.Доски.(
	|		Ссылка,
	|		НомерСтроки,
	|		Доска),
	|	Центр_Задача.Представление,
	|	Центр_Задача.МоментВремени
	|ИЗ
	|	Документ.Центр_Задача КАК Центр_Задача";
	
	//ПараметрыЗапроса = Новый Структура(, );
	ГруппаКолонки = Центр_ЭлементыФормы.СздГруппаОбычнаяБезОтображения(ЭтотОбъект, "ГруппаКолонки1", Элементы.ГруппаОсновногоБлока, 1);
	
	Центр_ЭлементыФормы.СоздатьКоманду(ЭтотОбъект, "НастройкиКолонки1", "Настройки", "ОткрытьНастройкиДинамическогоСпискаКолонки");
	КонпкаНстроекКолонки = Центр_ЭлементыФормы.СздКнопка(ЭтотОбъект, "НастройкиКолонки1Кнопка", ГруппаКолонки, "Настройки", "НастройкиКолонки1", 1);
	
	СтруктураКолонок = Новый Структура("Ссылка", "Задача");
	СтруктураСвойств = Новый Структура("ПоложениеКоманднойПанели", ПоложениеКоманднойПанелиЭлементаФормы.Нет);
	ТаблицаДСКолонки = Центр_ЭлементыФормы.СздДинамическийСписок(ЭтотОбъект, "Колонка1", ГруппаКолонки, ТекстЗапросаДС, , "Документ.Центр_Задача", СтруктураКолонок, СтруктураСвойств, , , );

	//ЭлементКолонка = Центр_ЭлементыФормы.СздКолонкаТаблицыФормы(ЭтотОбъект, "Задача", ТаблицаДСКолонки, 0, "Задача", "Колонка1.Ссылка");
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийКоманд
&НаКлиенте
Процедура СохранитьНастройкиОтборов(Команда)
	СохранитьНастройкиОтборовНаСервере();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы


#КонецОбласти




#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура НазначитьНастройкиКомпоновщика(Источник)
	НастройкиКомпоновкиДанных = ЭтотОбъект[Источник].КомпоновщикНастроек.ПолучитьИсточникДоступныхНастроек();
	НастройкиКолонки.Инициализировать(НастройкиКомпоновкиДанных);
	
	НастройкиКолонки.ЗагрузитьНастройки(ЭтотОбъект[Источник].КомпоновщикНастроек.ПолучитьНастройки());
КонецПроцедуры	
	
&НаКлиенте
Процедура ОткрытьНастройкиДинамическогоСпискаКолонки(Команда) Экспорт
	ИмяКолонки = "Колонка" + Прав(Команда.Имя, 1);
	НазначитьНастройкиКомпоновщика(ИмяКолонки);
	Элементы.НастройкиКолонкиПользовательскиеНастройки.Обновить();
	Элементы.ГруппаШапка.Показать();
КонецПроцедуры


&НаСервере
Процедура СохранитьНастройкиОтборовНаСервере()
	ЭтотОбъект[ИмяКолонки].КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиКолонки.ПолучитьНастройки());
	НастройкиКолонки.Восстановить();
	ИмяКолонки="";
	Элементы.ГруппаШапка.Скрыть();
КонецПроцедуры
#КонецОбласти