////////////////////////////////////////////////////////////////////////////////
// Сотрудники
//  
////////////////////////////////////////////////////////////////////////////////

// Возвращает основного сотрудника для физ. лица.
//
//
// Параметры:
//  ФизическоеЛицо - СправочникССылка.ФизическиеЛица
//
// Возвращаемое значение:
//   СправочникССылка.Сотрудники
//
Функция ОсновнойСотрудникФизЛица(ФизическоеЛицо) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ОсновныеСотрудники.Сотрудник КАК Сотрудник
		|ИЗ
		|	РегистрСведений.ОсновныеСотрудники КАК ОсновныеСотрудники
		|ГДЕ
		|	ОсновныеСотрудники.ФизическоеЛицо = &ФизическоеЛицо";
		
	Запрос.УстановитьПараметр("ФизическоеЛицо", ФизическоеЛицо);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Справочники.Сотрудники.ПустаяСсылка();
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	Возврат Выборка.Сотрудник;
	
КонецФункции
