
#Область ОбработчикиСобытийФормы
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Объект.Партнер ИЛИ Объект.Пользователь Тогда
		Возврат;
	Иначе
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = ("Не выбран Партнер или Пользователь");
		Сообщение.Сообщить();
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ПартнерПриИзменении(Элемент)
	Если Объект.Партнер Тогда
		Объект.Пользователь = Ложь;
	Иначе
		Объект.Пользователь = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПользовательПриИзменении(Элемент)
	Если Объект.Пользователь Тогда
		Объект.Партнер = Ложь;
	Иначе
		Объект.Партнер = Истина;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти