
#Область ОбработчикиСобытийФормы
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если ПереключательПостановщика = 
		ПредопределенноеЗначение("Перечисление.Центр_ПредставленияВидовЗадачПоПостановщику.Партнер") Тогда
		Объект.Партнер = Истина;
	ИначеЕсли ПереключательПостановщика = 
		ПредопределенноеЗначение("Перечисление.Центр_ПредставленияВидовЗадачПоПостановщику.Пользователь") Тогда
		Объект.Партнер = Ложь;
	Иначе 
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = ("Не выбран Партнер или Пользователь");
		Сообщение.Сообщить();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	Если Объект.Партнер Тогда
		ПереключательПостановщика = 
			ПредопределенноеЗначение("Перечисление.Центр_ПредставленияВидовЗадачПоПостановщику.Партнер");
	Иначе
		ПереключательПостановщика = 
			ПредопределенноеЗначение("Перечисление.Центр_ПредставленияВидовЗадачПоПостановщику.Пользователь");
	КонецЕсли;
КонецПроцедуры
#КонецОбласти