
#Область ПрограммныйИнтерфейс

// Возвращает физ. лицо сотрудника.
// 
// Параметры:
//  Сотрудник - СправочникСсылка.Сотрудники
// 
// Возвращаемое значение:
//  СправочникСсылка.ФизическиеЛица
//  
Функция ФизЛицоСотрудника(Сотрудник) Экспорт
	
	Возврат СотрудникиВызовСервера.ФизЛицоСотрудника(Сотрудник);
	
КонецФункции

// Возвращает основного сотрудника для физ. лица.
//
// Параметры:
//  ФизическоеЛицо - СправочникССылка.ФизическиеЛица
//
// Возвращаемое значение:
//   СправочникССылка.Сотрудники
//
Функция ОсновнойСотрудникФизЛица(ФизическоеЛицо) Экспорт
		
	Возврат СотрудникиВызовСервера.ОсновнойСотрудникФизЛица(ФизическоеЛицо);
	
КонецФункции

#КонецОбласти