////////////////////////////////////////////////////////////////////////////////
// Подсистема "Пользователи".
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Возвращает пользователя, связанного с физ. лицом.
// 
// Параметры:
//  ФизЛицо - СправочникСсылка.Пользователи
// 
// Возвращаемое значение:
//  СправочникСсылка.Пользователи
//
Функция ПользовательФизЛица(ФизЛицо) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Пользователи.Ссылка,
		|	Пользователи.Недействителен КАК Недействителен
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|ГДЕ
		|	Пользователи.ФизЛицо = &ФизЛицо
		|
		|УПОРЯДОЧИТЬ ПО
		|	Недействителен УБЫВ";
	
	Запрос.УстановитьПараметр("ФизЛицо", ФизЛицо);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Справочники.Пользователи.ПустаяСсылка();
	
КонецФункции

// Возвращает пользователей по физ лицам.
// 
// Параметры:
//  ФизЛица - Массив
//   * СправочникСсылка.ФизическиеЛица
// 
// Возвращаемое значение:
//  Соответствие
//   * Ключ - СправочникСсылка.ФизическиеЛица
//   * Значение - СправочникСсылка.Пользователи
//
Функция ПользователиПоФизЛицам(ФизЛица) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Пользователи.Ссылка,
		|	Пользователи.ФизЛицо
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|ГДЕ
		|	Пользователи.ФизЛицо В (&ФизЛица)";
		
	Запрос.УстановитьПараметр("ФизЛица", ФизЛица);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Результат = Новый Соответствие();
	
	Пока Выборка.Следующий() Цикл
		Результат[Выборка.ФизЛицо] = Выборка.Ссылка;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции


// Возвращает физ. лицо пользователя.
// Если пользователь не указан, то возвращает физ. лицо текущего пользователя. 
// 
// Параметры:
//  Пользователь - СправочникСсылка.Пользователи
// 
// Возвращаемое значение:
//  СправочникСсылка.ФизическиеЛица
//  
Функция ФизЛицоПользователя(Пользователь = Неопределено) Экспорт
	
	Если Пользователь = Неопределено Тогда
		Пользователь = Пользователи.ТекущийПользователь();
	КонецЕсли; 
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Пользователь, "ФизЛицо");
	
КонецФункции


#КонецОбласти
