#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции
Процедура СоздатьЗаписьСогласования(Задача, ТипОценки, Длительность, КомментарийОценки, Согласующий,
	ЧасыОт = Неопределено, ЧасыДо = Неопределено) Экспорт
	МенеджерЗаписи = СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Задача = Задача;
	МенеджерЗаписи.ТипОценки = ТипОценки;
	Если ЧасыОт <> Неопределено Тогда
		МенеджерЗаписи.От = ЧасыОт;
	КонецЕсли;
	Если ЧасыДо <> Неопределено Тогда
		МенеджерЗаписи.До = ЧасыДо;
	КонецЕсли;
	МенеджерЗаписи.Длительность = Длительность;
	МенеджерЗаписи.КомментарийОценки = КомментарийОценки;
	МенеджерЗаписи.Период = ТекущаяДатаСеанса();
	МенеджерЗаписи.Согласующий = Согласующий;
	МенеджерЗаписи.Согласовант = Пользователи.ТекущийПользователь();
	МенеджерЗаписи.Записать();
КонецПроцедуры

Процедура ИзменитьПоследнююЗаписьПоЗадаче(Задача, Отказ, Согласовано, КомментарийОтказа = Неопределено) Экспорт
	Набор = СоздатьНаборЗаписей();
	Набор.Отбор.Задача.Установить(Задача);
	Набор.Прочитать();
	Запись = Набор[Набор.Количество() - 1];
	Запись.Согласовано = Согласовано;
	Запись.Отказ = Отказ;
	Если КомментарийОтказа <> Неопределено Тогда
		Запись.КомментарийОтказа = КомментарийОтказа;
	КонецЕсли;
	Набор.Записать();
КонецПроцедуры
#КонецОбласти
#КонецЕсли