#Область ПрограммныйИнтерфейс
//Обработка добавления новой подсистемы
//Параметры:
//	Описание - ОписаниеНастроек
Процедура ПриДобавленииПодсистемы(Описание) Экспорт
	
	Описание.Имя = "УчетЗадач";
    Описание.Версия = "1.0.1.1";
    
    // Требуется библиотека стандартных подсистем.
    Описание.ТребуемыеПодсистемы.Добавить("СтандартныеПодсистемы");

КонецПроцедуры


//@skip-check module-empty-method
//@skip-check doc-comment-parameter-section
Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт
    
КонецПроцедуры

//Обработка обновления базы
//@skip-check module-empty-method
Процедура ПередОбновлениемИнформационнойБазы() Экспорт
    
КонецПроцедуры

//@skip-check module-empty-method
//@skip-check doc-comment-parameter-section
Процедура ПослеОбновленияИнформационнойБазы(Знач ПредыдущаяВерсия, Знач ТекущаяВерсия,
        Знач ВыполненныеОбработчики, ВыводитьОписаниеОбновлений, МонопольныйРежим) Экспорт
    
КонецПроцедуры

//@skip-check module-empty-method
//@skip-check doc-comment-parameter-section
Процедура ПриПодготовкеМакетаОписанияОбновлений(Знач Макет) Экспорт
    
КонецПроцедуры

//@skip-check module-empty-method
//@skip-check doc-comment-parameter-section
Процедура ПриДобавленииОбработчиковПереходаСДругойПрограммы(Обработчики) Экспорт
    
КонецПроцедуры

//@skip-check module-empty-method
//@skip-check doc-comment-parameter-section
Процедура ПриОпределенииРежимаОбновленияДанных(РежимОбновленияДанных, СтандартнаяОбработка) Экспорт
    
КонецПроцедуры 

//@skip-check module-empty-method
//@skip-check doc-comment-parameter-section
Процедура ПриЗавершенииПереходаСДругойПрограммы(Знач ПредыдущееИмяКонфигурации, Знач ПредыдущаяВерсияКонфигурации, Параметры) Экспорт
    
КонецПроцедуры
   #КонецОбласти