////////////////////////////////////////////////////////////////////////////////
// Работа с часовыми поясами (сервер, повторное использование на время сеанса).
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Формирует данные известных часовых поясов.
// 
// Возвращаемое значение:
//  Массив из Структура - Данные известных часовых поясов. См. РаботаСЧасовымиПоясамиКлиентСервер.НовыйДанныеЧасовогоПояса().
//
Функция ИзвестныеЧасовыеПояса() Экспорт
	
	ИзвестныеЧасовыеПояса = Новый Соответствие;
	
	ДанныеЧасовогоПояса =
		РаботаСЧасовымиПоясамиКлиентСервер.НовыйДанныеЧасовогоПояса(
			НСтр("ru = '(UTC-12:00) Линия перемены дат'"),
			"-",
			12,
			0);
	ИзвестныеЧасовыеПояса.Вставить(ДанныеЧасовогоПояса.ЧасовойПояс, ДанныеЧасовогоПояса);
	
	ДанныеЧасовогоПояса =
		РаботаСЧасовымиПоясамиКлиентСервер.НовыйДанныеЧасовогоПояса(
			НСтр("ru = '(UTC-11:00) Время в формате UTC -11'"),
			"-",
			11,
			0);
	ИзвестныеЧасовыеПояса.Вставить(ДанныеЧасовогоПояса.ЧасовойПояс, ДанныеЧасовогоПояса);
	
	ДанныеЧасовогоПояса =
		РаботаСЧасовымиПоясамиКлиентСервер.НовыйДанныеЧасовогоПояса(
			НСтр("ru = '(UTC-10:00) Гавайи'"),
			"-",
			10,
			0);
	ИзвестныеЧасовыеПояса.Вставить(ДанныеЧасовогоПояса.ЧасовойПояс, ДанныеЧасовогоПояса);
	
	ДанныеЧасовогоПояса =
		РаботаСЧасовымиПоясамиКлиентСервер.НовыйДанныеЧасовогоПояса(
			НСтр("ru = '(UTC-09:00) Аляска'"),
			"-",
			9,
			0);
	ИзвестныеЧасовыеПояса.Вставить(ДанныеЧасовогоПояса.ЧасовойПояс, ДанныеЧасовогоПояса);
	
	ДанныеЧасовогоПояса =
		РаботаСЧасовымиПоясамиКлиентСервер.НовыйДанныеЧасовогоПояса(
			НСтр("ru = '(UTC-08:00) Тихоокеанское время (США и Канада)'"),
			"-",
			8,
			0);
	ИзвестныеЧасовыеПояса.Вставить(ДанныеЧасовогоПояса.ЧасовойПояс, ДанныеЧасовогоПояса);
	
	ДанныеЧасовогоПояса =
		РаботаСЧасовымиПоясамиКлиентСервер.НовыйДанныеЧасовогоПояса(
			НСтр("ru = '(UTC-07:00) Горное время (США и Канада)'"),
			"-",
			7,
			0);
	ИзвестныеЧасовыеПояса.Вставить(ДанныеЧасовогоПояса.ЧасовойПояс, ДанныеЧасовогоПояса);
	
	ДанныеЧасовогоПояса =
		РаботаСЧасовымиПоясамиКлиентСервер.НовыйДанныеЧасовогоПояса(
			НСтр("ru = '(UTC-06:00) Центральное время (США и Канада)'"),
			"-",
			6,
			0);
	ИзвестныеЧасовыеПояса.Вставить(ДанныеЧасовогоПояса.ЧасовойПояс, ДанныеЧасовогоПояса);
	
	ДанныеЧасовогоПояса =
		РаботаСЧасовымиПоясамиКлиентСервер.НовыйДанныеЧасовогоПояса(
			НСтр("ru = '(UTC-05:00) Восточное время (США и Канада)'"),
			"-",
			5,
			0);
	ИзвестныеЧасовыеПояса.Вставить(ДанныеЧасовогоПояса.ЧасовойПояс, ДанныеЧасовогоПояса);
	
	ДанныеЧасовогоПояса =
		РаботаСЧасовымиПоясамиКлиентСервер.НовыйДанныеЧасовогоПояса(
			НСтр("ru = '(UTC-04:00) Атлантическое время (Канада)'"),
			"-",
			4,
			0);
	ИзвестныеЧасовыеПояса.Вставить(ДанныеЧасовогоПояса.ЧасовойПояс, ДанныеЧасовогоПояса);
	
	ДанныеЧасовогоПояса =
		РаботаСЧасовымиПоясамиКлиентСервер.НовыйДанныеЧасовогоПояса(
			НСтр("ru = '(UTC-03:00) Бразилия'"),
			"-",
			3,
			0);
	ИзвестныеЧасовыеПояса.Вставить(ДанныеЧасовогоПояса.ЧасовойПояс, ДанныеЧасовогоПояса);
	
	ДанныеЧасовогоПояса =
		РаботаСЧасовымиПоясамиКлиентСервер.НовыйДанныеЧасовогоПояса(
			НСтр("ru = '(UTC-02:00) Время в формате UTC -02'"),
			"-",
			2,
			0);
	ИзвестныеЧасовыеПояса.Вставить(ДанныеЧасовогоПояса.ЧасовойПояс, ДанныеЧасовогоПояса);
	
	ДанныеЧасовогоПояса =
		РаботаСЧасовымиПоясамиКлиентСервер.НовыйДанныеЧасовогоПояса(
			НСтр("ru = '(UTC-01:00) Азорские острова'"),
			"-",
			1,
			0);
	ИзвестныеЧасовыеПояса.Вставить(ДанныеЧасовогоПояса.ЧасовойПояс, ДанныеЧасовогоПояса);
	
	ДанныеЧасовогоПояса =
		РаботаСЧасовымиПоясамиКлиентСервер.НовыйДанныеЧасовогоПояса(
			НСтр("ru = '(UTC+00:00) Лондон'"),
			"+",
			0,
			0);
	ИзвестныеЧасовыеПояса.Вставить(ДанныеЧасовогоПояса.ЧасовойПояс, ДанныеЧасовогоПояса);
	
	ДанныеЧасовогоПояса =
		РаботаСЧасовымиПоясамиКлиентСервер.НовыйДанныеЧасовогоПояса(
			НСтр("ru = '(UTC+01:00) Берлин'"),
			"+",
			1,
			0);
	ИзвестныеЧасовыеПояса.Вставить(ДанныеЧасовогоПояса.ЧасовойПояс, ДанныеЧасовогоПояса);
	
	ДанныеЧасовогоПояса =
		РаботаСЧасовымиПоясамиКлиентСервер.НовыйДанныеЧасовогоПояса(
			НСтр("ru = '(UTC+02:00) Калининград'"),
			"+",
			2,
			0);
	ИзвестныеЧасовыеПояса.Вставить(ДанныеЧасовогоПояса.ЧасовойПояс, ДанныеЧасовогоПояса);
	
	ДанныеЧасовогоПояса =
		РаботаСЧасовымиПоясамиКлиентСервер.НовыйДанныеЧасовогоПояса(
			НСтр("ru = '(UTC+03:00) Москва'"),
			"+",
			3,
			0);
	ИзвестныеЧасовыеПояса.Вставить(ДанныеЧасовогоПояса.ЧасовойПояс, ДанныеЧасовогоПояса);
	
	ДанныеЧасовогоПояса =
		РаботаСЧасовымиПоясамиКлиентСервер.НовыйДанныеЧасовогоПояса(
			НСтр("ru = '(UTC+04:00) Саратов'"),
			"+",
			4,
			0);
	ИзвестныеЧасовыеПояса.Вставить(ДанныеЧасовогоПояса.ЧасовойПояс, ДанныеЧасовогоПояса);
	
	ДанныеЧасовогоПояса =
		РаботаСЧасовымиПоясамиКлиентСервер.НовыйДанныеЧасовогоПояса(
			НСтр("ru = '(UTC+05:00) Екатеринбург'"),
			"+",
			5,
			0);
	ИзвестныеЧасовыеПояса.Вставить(ДанныеЧасовогоПояса.ЧасовойПояс, ДанныеЧасовогоПояса);
	
	ДанныеЧасовогоПояса =
		РаботаСЧасовымиПоясамиКлиентСервер.НовыйДанныеЧасовогоПояса(
			НСтр("ru = '(UTC+06:00) Омск'"),
			"+",
			6,
			0);
	ИзвестныеЧасовыеПояса.Вставить(ДанныеЧасовогоПояса.ЧасовойПояс, ДанныеЧасовогоПояса);
	
	ДанныеЧасовогоПояса =
		РаботаСЧасовымиПоясамиКлиентСервер.НовыйДанныеЧасовогоПояса(
			НСтр("ru = '(UTC+07:00) Новосибирск'"),
			"+",
			7,
			0);
	ИзвестныеЧасовыеПояса.Вставить(ДанныеЧасовогоПояса.ЧасовойПояс, ДанныеЧасовогоПояса);
	
	ДанныеЧасовогоПояса =
		РаботаСЧасовымиПоясамиКлиентСервер.НовыйДанныеЧасовогоПояса(
			НСтр("ru = '(UTC+08:00) Иркутск'"),
			"+",
			8,
			0);
	ИзвестныеЧасовыеПояса.Вставить(ДанныеЧасовогоПояса.ЧасовойПояс, ДанныеЧасовогоПояса);
	
	ДанныеЧасовогоПояса =
		РаботаСЧасовымиПоясамиКлиентСервер.НовыйДанныеЧасовогоПояса(
			НСтр("ru = '(UTC+09:00) Якутск'"),
			"+",
			9,
			0);
	ИзвестныеЧасовыеПояса.Вставить(ДанныеЧасовогоПояса.ЧасовойПояс, ДанныеЧасовогоПояса);
	
	ДанныеЧасовогоПояса =
		РаботаСЧасовымиПоясамиКлиентСервер.НовыйДанныеЧасовогоПояса(
			НСтр("ru = '(UTC+09:30) Дарвин'"),
			"+",
			9,
			30);
	ИзвестныеЧасовыеПояса.Вставить(ДанныеЧасовогоПояса.ЧасовойПояс, ДанныеЧасовогоПояса);
	
	ДанныеЧасовогоПояса =
		РаботаСЧасовымиПоясамиКлиентСервер.НовыйДанныеЧасовогоПояса(
			НСтр("ru = '(UTC+10:00) Владивосток'"),
			"+",
			10,
			0);
	ИзвестныеЧасовыеПояса.Вставить(ДанныеЧасовогоПояса.ЧасовойПояс, ДанныеЧасовогоПояса);
	
	ДанныеЧасовогоПояса =
		РаботаСЧасовымиПоясамиКлиентСервер.НовыйДанныеЧасовогоПояса(
			НСтр("ru = '(UTC+11:00) Сахалин'"),
			"+",
			11,
			0);
	ИзвестныеЧасовыеПояса.Вставить(ДанныеЧасовогоПояса.ЧасовойПояс, ДанныеЧасовогоПояса);
	
	ДанныеЧасовогоПояса =
		РаботаСЧасовымиПоясамиКлиентСервер.НовыйДанныеЧасовогоПояса(
			НСтр("ru = '(UTC+12:00) Петропавловск-Камчатский'"),
			"+",
			12,
			0);
	ИзвестныеЧасовыеПояса.Вставить(ДанныеЧасовогоПояса.ЧасовойПояс, ДанныеЧасовогоПояса);
	
	ДанныеЧасовогоПояса =
		РаботаСЧасовымиПоясамиКлиентСервер.НовыйДанныеЧасовогоПояса(
			НСтр("ru = '(UTC+13:00) Самоа'"),
			"+",
			13,
			0);
	ИзвестныеЧасовыеПояса.Вставить(ДанныеЧасовогоПояса.ЧасовойПояс, ДанныеЧасовогоПояса);
	
	ДанныеЧасовогоПояса =
		РаботаСЧасовымиПоясамиКлиентСервер.НовыйДанныеЧасовогоПояса(
			НСтр("ru = '(UTC+14:00) Острова Киритимати'"),
			"+",
			14,
			0);
	ИзвестныеЧасовыеПояса.Вставить(ДанныеЧасовогоПояса.ЧасовойПояс, ДанныеЧасовогоПояса);
	
	Возврат ИзвестныеЧасовыеПояса;
	
КонецФункции

// Возвращает настройку программы "Режим отображения местного времени".
// 
// Возвращаемое значение:
//  ПеречислениеСсылка.РежимыОтображенияМестногоВремени - Настройка программы "Режим отображения местного времени".
//
Функция НастройкаРежимОтображенияМестногоВремени() Экспорт
	
	НастройкаРежимОтображенияМестногоВремени = Константы.РежимОтображенияМестногоВремени.Получить();
	
	Возврат НастройкаРежимОтображенияМестногоВремени;
	
КонецФункции

// Возвращает действующий режим отображения местного времени.
// 
// Возвращаемое значение:
//  ПеречислениеСсылка.РежимыОтображенияМестногоВремени - Действующий режим отображения местного времени.
//
Функция РежимОтображенияМестногоВремени() Экспорт
	
	Возврат РаботаСЧасовымиПоясами.РежимОтображенияМестногоВремени();
	
КонецФункции

// Возвращает часовой пояс по умолчанию.
//
// Возвращаемое значение:
//  Строка - Часовой пояс по умолчанию в формате GMT{+/-}hh:mm.
//
Функция ЧасовойПоясПоУмолчанию() Экспорт
	
	Возврат РаботаСЧасовымиПоясамиКлиентСервер.ЧасовойПоясСмещением(
		СмещениеСтандартногоВремени(
			ЧасовойПоясСеанса()));
	
КонецФункции

// Возвращает часовой пояс пользователя.
// 
// Параметры:
//  ПользовательИлиСотрудник - СправочникСсылка.Пользователи, СправочникСсылка.Сотрудники.
//
// Возвращаемое значение:
//  Строка - Часовой пояс пользователя в формате GMT{+/-}hh:mm.
//
Функция ЧасовойПоясПользователя(ПользовательИлиСотрудник) Экспорт
	
	Возврат РаботаСЧасовымиПоясами.ЧасовойПоясПользователя(ПользовательИлиСотрудник);
	
КонецФункции

#КонецОбласти