#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Находит запись календаря по идентификатору.
//
// Параметры:
//  Узел                   - ПланОбменаСсылка.СинхронизацияКалендарей - Узел обмена.
//  ИдентификаторКалендаря - Строка                                   - Идентификатор календаря.
//  Идентификатор          - Строка                                    - Идентификатор записи календаря.
// 
// Возвращаемое значение:
//  СправочникСсылка.ЗаписиРабочегоКалендаря - Найденная запись календаря.
//
Функция НайтиПоИдентификатору(Узел, ИдентификаторКалендаря, Идентификатор) Экспорт
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ЗаписиСинхронизацииКалендарей.ЗаписьРабочегоКалендаря КАК ЗаписьРабочегоКалендаря
		|ИЗ
		|	РегистрСведений.ЗаписиСинхронизацииКалендарей КАК ЗаписиСинхронизацииКалендарей
		|ГДЕ
		|	ЗаписиСинхронизацииКалендарей.Узел = &Узел
		|	И ЗаписиСинхронизацииКалендарей.ИдентификаторКалендаря ПОДОБНО &ИдентификаторКалендаря
		|	И ЗаписиСинхронизацииКалендарей.Идентификатор ПОДОБНО &Идентификатор");
	
	Запрос.УстановитьПараметр("Узел", Узел);
	Запрос.УстановитьПараметр("ИдентификаторКалендаря", ИдентификаторКалендаря);
	Запрос.УстановитьПараметр("Идентификатор", Идентификатор);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат ?(Выборка.Следующий(),
		Выборка.ЗаписьРабочегоКалендаря,
		Справочники.ЗаписиРабочегоКалендаря.ПустаяСсылка());
	
КонецФункции

#КонецОбласти

#КонецЕсли

