#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ЗаписиКалендаря = Новый Массив;
	Для Каждого ЭлементПараметраКоманды Из ПараметрКоманды Цикл
		
		ЗаписьКалендаря = РаботаСРабочимКалендаремКлиентСервер.НовыйЭлементЗаписиКалендаря();
		ЗаписьКалендаря.Ссылка = ЭлементПараметраКоманды;
		
		ЗаписиКалендаря.Добавить(ЗаписьКалендаря);
		
	КонецЦикла;
	
	РаботаСРабочимКалендаремКлиент.ПринятьПриглашение(ЗаписиКалендаря);
	
КонецПроцедуры

#КонецОбласти