
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Автор = ПараметрыСеанса.ТекущийПользователь; 
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Центр_ИсполнителиЗадачСрезПоследних.Исполнитель,
		|	Центр_ИсполнителиЗадачСрезПоследних.Задача,
		|	Центр_СтатусыЗадачСрезПоследних.Статус
		|ИЗ
		|	РегистрСведений.Центр_ИсполнителиЗадач.СрезПоследних(, Задача = &Задача) КАК Центр_ИсполнителиЗадачСрезПоследних
		|		ПОЛНОЕ СОЕДИНЕНИЕ РегистрСведений.Центр_СтатусыЗадач.СрезПоследних(, Задача = &Задача) КАК
		|			Центр_СтатусыЗадачСрезПоследних
		|		ПО Центр_СтатусыЗадачСрезПоследних.Задача = Центр_ИсполнителиЗадачСрезПоследних.Задача";

	Запрос.УстановитьПараметр("Задача", Ссылка);

	РезультатЗапроса = Запрос.Выполнить();

	Выборка = РезультатЗапроса.Выбрать();

	Если Выборка.Следующий() Тогда
		Если Выборка.Статус = ПредопределенноеЗначение("Справочник.Центр_СтатусыЗадач.Новая") Или Выборка.Статус
			= ПредопределенноеЗначение("Справочник.Центр_СтатусыЗадач.ИполнительНазначен") или не ЗначениеЗаполнено(Выборка.Статус) Тогда

			Если Не ЗначениеЗаполнено(Выборка.Исполнитель) И Выборка.Статус <> ПредопределенноеЗначение(
				"Справочник.Центр_СтатусыЗадач.Новая") Тогда
				
				МенеджерЗаписи = РегистрыСведений.Центр_СтатусыЗадач.СоздатьМенеджерЗаписи();
				МенеджерЗаписи.Статус  = ПредопределенноеЗначение("Справочник.Центр_СтатусыЗадач.Новая");
				МенеджерЗаписи.Задача =Ссылка;
				МенеджерЗаписи.Период = ТекущаяДатаСеанса();
				МенеджерЗаписи.Записать();
			КонецЕсли;

			Если ЗначениеЗаполнено(Выборка.Исполнитель) И Выборка.Статус <> ПредопределенноеЗначение(
				"Справочник.Центр_СтатусыЗадач.ИполнительНазначен") Тогда
				
				МенеджерЗаписи = РегистрыСведений.Центр_СтатусыЗадач.СоздатьМенеджерЗаписи();
				МенеджерЗаписи.Статус  = ПредопределенноеЗначение("Справочник.Центр_СтатусыЗадач.ИполнительНазначен");
				МенеджерЗаписи.Задача =Ссылка;
				МенеджерЗаписи.Период = ТекущаяДатаСеанса();
				МенеджерЗаписи.Записать();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры