#Область ОбработчикиСобытий
// @skip-check module-accessibility-at-client
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Центр_Задача") Тогда		
		Часы = 8;
		Основание = ДанныеЗаполнения;
	КонецЕсли;
КонецПроцедуры

// @skip-check module-accessibility-at-client
Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Движения.Центр_ЧасыТрудозатрат.Записывать = Истина;
	Движение = Движения.Центр_ЧасыТрудозатрат.Добавить();
	Движение.Период = Дата;
	Движение.Исполнитель = ПараметрыСеанса.ТекущийПользователь;
	Движение.Часы = Часы;	
КонецПроцедуры

#КонецОбласти