#Область ОбработчикиСобытий
// @skip-check module-accessibility-at-client
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Центр_Задача") Тогда
		Часы = 8;
		Основание = ДанныеЗаполнения;
	КонецЕсли;
КонецПроцедуры

// @skip-check module-accessibility-at-client
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	


	Движения.Центр_ЧасыТрудозатрат.Записывать = Истина;
	
	Движение = Движения.Центр_ЧасыТрудозатрат.Добавить();
	Движение.Период = Дата;
	Движение.Исполнитель = ПараметрыСеанса.ТекущийПользователь;
	Движение.Часы = Часы;
	
	Движения.Центр_ЧасыТрудозатрат.БлокироватьДляИзменения = Истина;
	Движения.Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СУММА(Центр_ЧасыТрудозатрат.Часы) КАК Часы,
	|	Центр_ТрудозатратыПоЗадаче.Основание
	|ПОМЕСТИТЬ вт_ЧасыПоЗадаче
	|ИЗ
	|	Документ.Центр_ТрудозатратыПоЗадаче КАК Центр_ТрудозатратыПоЗадаче
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Центр_ЧасыТрудозатрат КАК Центр_ЧасыТрудозатрат
	|		ПО Центр_ЧасыТрудозатрат.Регистратор = Центр_ТрудозатратыПоЗадаче.Ссылка
	|		И Центр_ТрудозатратыПоЗадаче.Основание = &Задача
	|СГРУППИРОВАТЬ ПО
	|	Центр_ТрудозатратыПоЗадаче.Основание
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Центр_ОценкаЧасовСрезПоследних.Часы,
	|	Центр_ОценкаЧасовСрезПоследних.Часы - ЕСТЬNULL(вт_ЧасыПоЗадаче.Часы, 0) КАК ЧасыИтог
	|ИЗ
	|	вт_ЧасыПоЗадаче КАК вт_ЧасыПоЗадаче
	|		ПОЛНОЕ СОЕДИНЕНИЕ РегистрСведений.Центр_ОценкаЧасов.СрезПоследних(, Задача = &Задача) КАК
	|			Центр_ОценкаЧасовСрезПоследних
	|		ПО вт_ЧасыПоЗадаче.Основание = Центр_ОценкаЧасовСрезПоследних.Задача
	|ГДЕ
	|	Центр_ОценкаЧасовСрезПоследних.Согласовано";

	Запрос.УстановитьПараметр("Задача", Основание);

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	ВыборкаДетальныеЗаписи.Следующий();
	
	Если ВыборкаДетальныеЗаписи.ЧасыИтог < 0 Тогда
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Часов больше чем согласовано на " + (-ВыборкаДетальныеЗаписи.ЧасыИтог) + " часов";
		Сообщение.Сообщить();

		
	КонецЕсли;
КонецПроцедуры

#КонецОбласти