
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//@skip-check unknown-form-parameter-access
	Если Параметры.Свойство("Задача") Тогда
		Если ЗначениеЗаполнено(Параметры.Задача) Тогда
			Задача=Параметры.Задача;
		КонецЕсли;
	КонецЕсли;	
	//@skip-check unknown-form-parameter-access
	Если Параметры.Свойство("ЭтоДень") Тогда
		Если Параметры.ЭтоДень Тогда
			ЕдиницаИзмерения = ПредопределенноеЗначение("Перечисление.Центр_ЕдиницыИзмеренийВремени.День");
		Иначе
			ЕдиницаИзмерения = ПредопределенноеЗначение("Перечисление.Центр_ЕдиницыИзмеренийВремени.Час");
		КонецЕсли;
	КонецЕсли;
	//@skip-check unknown-form-parameter-access
	Если Параметры.Свойство("Дедлайн") Тогда
		Если ЗначениеЗаполнено(Параметры.Дедлайн) Тогда
			Дедлайн=Параметры.Дедлайн;
		КонецЕсли;
	КонецЕсли;
	//@skip-check unknown-form-parameter-access
	Если Параметры.Свойство("Длительность") Тогда
		Если ЗначениеЗаполнено(Параметры.Длительность) Тогда
			Длительность=Параметры.Длительность;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

 
#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура Готово(Команда)
	ГотовоНаСервере();
	Закрыть();
КонецПроцедуры
#КонецОбласти


#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ГотовоНаСервере()
	Док = Задача.ПолучитьОбъект();
	Док.Длительность = Длительность;
	Док.Дедлайн = Дедлайн;
	Если ЕдиницаИзмерения = ПредопределенноеЗначение("Перечисление.Центр_ЕдиницыИзмеренийВремени.День") Тогда
		Док.ЭтоДень = Истина;
	Иначе
		Док.ЭтоДень = Ложь;
	КонецЕсли;
	Док.Записать(РежимЗаписиДокумента.Проведение);

	МенеджерЗаписи = РегистрыСведений.Центр_ИсполнителиЗадач.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Задача = Задача;
	МенеджерЗаписи.Исполнитель  = Пользователи.АвторизованныйПользователь();
	МенеджерЗаписи.Период = ТекущаяДатаСеанса();
	МенеджерЗаписи.Записать();
	
	Центр_ОбработкаТриггеров.ТриггерВзятиеЗадачи(Задача);
	
КонецПроцедуры
#КонецОбласти

