// Создает событие календаря с заполнением предмета, даты начала, даты окончания по необходимости.
//
// Параметры:
//  Предмет			 - СправочникСсылка			 - Предмет.
//  ДатаНачала		 - Дата						 - Дата начала.
//  ДатаОкончания	 - Дата						 - Дата окончания.
//  ВесьДень		 - Булево					 - Признак длительность на весь день.
//  Описание		 - Строка					 - Описание записи календаря.
//  Сотрудник	 - СправочникСсылка.Сотрудники   - Сотрудник записи календаря.
//
Процедура СоздатьЗаписьКалендаря(Предмет = Неопределено, ДатаНачала = Неопределено,
	ДатаОкончания = Неопределено, ВесьДень = Неопределено,
	Описание = Неопределено, Сотрудник = Неопределено) Экспорт
	
	СтруктураОснование = Новый Структура;
	Если Предмет <> Неопределено Тогда
		СтруктураОснование.Вставить("Предмет", Предмет);
	КонецЕсли;
	Если ДатаНачала <> Неопределено Тогда
		СтруктураОснование.Вставить("ДатаНачала", ДатаНачала);
	КонецЕсли;
	Если ДатаОкончания <> Неопределено Тогда
		СтруктураОснование.Вставить("ДатаОкончания", ДатаОкончания);
	КонецЕсли;
	Если ВесьДень <> Неопределено Тогда
		СтруктураОснование.Вставить("ВесьДень", Предмет);
	КонецЕсли;
	Если Описание <> Неопределено Тогда
		СтруктураОснование.Вставить("Описание", Описание);
	КонецЕсли;
	Если Сотрудник <> Неопределено Тогда
		СтруктураОснование.Вставить("Сотрудник", Сотрудник);
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("Основание");
	ПараметрыФормы.Основание = СтруктураОснование;
	
	ОткрытьФормуЗаписиКалендаря(ПараметрыФормы);
	
КонецПроцедуры
   

// Открывает форму записи календаря.
//
// Параметры:
//  Параметры	 - Структура	 - Параметры формы.
//  Уникальность - Произвольный	 - Уникальность формы.
//
Процедура ОткрытьФормуЗаписиКалендаря(Параметры, Уникальность = Неопределено)
	
	Если Уникальность = Неопределено Тогда
		Уникальность = Новый УникальныйИдентификатор;
	КонецЕсли;
	
	ОткрытьФорму("Справочник.ЗаписиРабочегоКалендаря.ФормаОбъекта", Параметры,, Уникальность);
	
КонецПроцедуры


