//////////////////////////////////////////////////////////////////////////////////
//// Должностные лица (вызов сервера)
////  
//////////////////////////////////////////////////////////////////////////////////

//#Область ПрограммныйИнтерфейс

//#Область ДляВызоваИзДругихПодсистем

//// Вернет параметры для модуля приложения
////
////Возвращаемое значение 
////  Структура  (СотрудникиТекущегоПользователя, РолиТекущегоПользователя)
//Функция ПараметрыПередНачаломРаботы() Экспорт
//	
//	Возврат Новый Структура("СотрудникиТекущегоПользователя, РолиТекущегоПользователя, ОсновнойСотрудник",
//		ПользовательИЕгоСотрудники(), 
//		РолиТекущегоПользователя(),
//		ОсновнойСотрудник());
//	
//КонецФункции

//#КонецОбласти

//#Область ПереходНаСотрудников

//// Возвращает любого пользователя сотрудника.
////  см. одноименную функцию в общ. модуле Сотрудники
////
//Функция ЛюбойПользовательСотрудника(Сотрудник) Экспорт
//	
//	Возврат Сотрудники.ЛюбойПользовательСотрудника(Сотрудник);
//	
//КонецФункции

//// Возвращает для каждого сотрудника любого его пользователя.
////  см. одноименную функцию в общ. модуле Сотрудники
////
//Функция ЛюбыеПользователиСотрудников(Сотрудники) Экспорт
//	
//	Возврат Сотрудники.ЛюбыеПользователиСотрудников(Сотрудники);
//	
//КонецФункции

//// Возвращает для каждого пользователя любого его сотрудника.
////  см. одноименную функцию в общ. модуле Сотрудники
////
//Функция ЛюбыеСотрудникиПользователей(Пользователи) Экспорт
//	
//	Возврат Сотрудники.ЛюбыеСотрудникиПользователей(Пользователи);
//	
//КонецФункции

//// Возвращает единым списком пользователя и его сотрудников.
//// Используется на время подключения сотрудников к объектам ДО.
////
//// Параметры:
////  Пользователь - СправочникСсылка.Пользователи
////                 Неопределено - будет сформирован список для текущего пользователя.
////  Действительные - Булево - признак получения действительных сотрудников.
////
//// Возвращаемое значение:
////  Массив
////   * СправочникСсылка.Сотрудники, СправочникСсылка.Пользователи
////
//Функция ПользовательИЕгоСотрудники(Знач Пользователь = Неопределено, Знач Действительные = Истина) Экспорт
//	
//	Возврат Сотрудники.ПользовательИЕгоСотрудники(Пользователь, Действительные);
//	
//КонецФункции

//// Возвращает единственного пользователя сотрудника. Если пользователей несколько, выбирается наиболее актуальный.
////
//// Параметры:
////  Сотрудник - СправочникСсылка.Сотрудники -  исходный сотрудник.
//// 
//// Возвращаемое значение:
////   -  СправочникСсылка.Пользователи
////
//Функция ПриоритетныйПользовательСотрудника(Сотрудник) Экспорт
//	
//	Возврат Сотрудники.ПриоритетныйПользовательСотрудника(Сотрудник);
//	
//КонецФункции

//#КонецОбласти

//// Возвращает сотрудников пользователя.
////  см. одноименную функцию в общ. модуле Сотрудники
////
//Функция СотрудникиПользователя(Знач Пользователь = Неопределено, Знач Действительные = Истина) Экспорт
//	
//	Возврат Сотрудники.СотрудникиПользователя(Пользователь, Действительные);
//	
//КонецФункции

//// Проверяет сотрудника на принадлежность у текущему пользователю.
////  см. одноименную функцию в общ. модуле Сотрудники
////
//Функция ЭтоСотрудникПользователя(Сотрудник, Знач Пользователь = Неопределено) Экспорт
//	
//	Возврат Сотрудники.ЭтоСотрудникПользователя(Сотрудник, Пользователь);
//	
//КонецФункции

//// Возвращает основного сотрудника пользователя.
////  см. одноименную функцию в общ. модуле Сотрудники
//// 
//Функция ОсновнойСотрудникПользователя(Пользователь) Экспорт
//	
//	Возврат Сотрудники.ОсновнойСотрудникПользователя(Пользователь);
//	
//КонецФункции

//// Возвращает текущего сотрудника.
//// 
//// Возвращаемое значение:
////  СправочникСсылка.Сотрудники - Текущий сотрудник.
////
//Функция ОсновнойСотрудник() Экспорт
//	
//	Возврат Сотрудники.ОсновнойСотрудник();
//	
//КонецФункции

//// Возвращает подразделение сотрудника.
////
//// Параметры:
////  Сотрудник - СправочникСсылка.Сотрудники
////
//// Возвращаемое значение:
////  СправочникСсылка.СтруктураПредприятия
////
//Функция ПодразделениеСотрудника(Сотрудник) Экспорт
//	
//	Возврат Сотрудники.ПодразделениеСотрудника(Сотрудник);
//	
//КонецФункции

//// Возвращает список сотрудников и, если указано, их контейнеров и автоподстановок для целей автоподбора.
////
//// Параметры:
////   Текст - Строка - символы, введенные пользователем.
////   ДополнениеТипа - ОписаниеТипов - необязательный, дополнение типа выбираемых объектов (по умолчанию - только
////     пользователи. Для автоподстановок указывается тип "Строка".
////   ТипОбъекта - ПеречислениеСсылка.ТипыОбъектов - Тип объекта, для дополнения типа "СправочникСсылка.АвтоподстановкиДляОбъектов".
////   ПараметрыПолученияДанных - Структура - Дополнительные параметры получения данных:
////    * КонтролироватьСотрудниковБезПользователя - Булево - Если Истина, то возвращается структура с указанием,
////                                                          что сотрудник без пользователя. Актуально только 
////                                                          для сотрудников. 
////
//// Возвращаемое значение:
////   СписокЗначений - подходящие пользователи (контейнеры, автоподстановки) и их представления с уточнением.
////
//Функция СформироватьДанныеВыбора(Текст,
//	Знач ДополнениеТипа = Неопределено, ТипОбъекта = Неопределено, ПараметрыПолученияДанных = Неопределено) Экспорт
//	
//	Возврат Сотрудники.СформироватьДанныеВыбора(Текст, ДополнениеТипа, ТипОбъекта, ПараметрыПолученияДанных);
//	
//КонецФункции

//// Возвращает список сотрудников и, если указано, их контейнеров и автоподстановок для целей автоподбора.
////
//// Параметры:
////   Текст - Строка - символы, введенные пользователем.
////
//// Возвращаемое значение:
////   СписокЗначений - подходящие пользователи (контейнеры, автоподстановки) и их представления с уточнением.
////
//Функция СформироватьДанныеВыборасКонтейнерами(Текст) Экспорт
//	
//	Возврат Сотрудники.СформироватьДанныеВыборасКонтейнерами(Текст);
//	
//КонецФункции

//// Вернет Истина, если текущий пользователь или его сотрудники является исполнителем
//// 
////Параметры
////	Исполнитель - СправочникСсылка.Пользователи, СправочникСсылка.Сотрудники, СправочникСсылка.ПолныеРоли
////
//// Возвращаемое значение:
////   Булево
////
//Функция ТекущийПользовательИсполнитель(Исполнитель) Экспорт
//	
//	ТекущийПользователь = Пользователи.ТекущийПользователь();
//	
//	Если ТипЗнч(Исполнитель) = Тип("СправочникСсылка.Пользователи") Тогда 
//		Возврат (ТекущийПользователь = Исполнитель);
//	ИначеЕсли ТипЗнч(Исполнитель) = Тип("СправочникСсылка.Сотрудники") Тогда 
//		Возврат Сотрудники.ЭтоСотрудникПользователя(Исполнитель);
//	Иначе
//		УстановитьПривилегированныйРежим(Истина);
//		
//		СотрудникиПользователя = Сотрудники.СотрудникиПользователя();
//		Для Каждого ИсполнительРоли Из РегистрыСведений.ИсполнителиРолей.ИсполнителиРоли(Исполнитель) Цикл
//			Если СотрудникиПользователя.Найти(ИсполнительРоли) <> Неопределено Тогда
//				Возврат Истина;
//			КонецЕсли;
//		КонецЦикла;
//		
//		Возврат Ложь;
//		
//	КонецЕсли;
//	
//КонецФункции

//// Вернет роли текущего пользователя - массив
//Функция РолиТекущегоПользователя() Экспорт
//	
//	Возврат Сотрудники.РолиТекущегоПользователя();
//	
//КонецФункции	

//// Возвращает физ. лицо сотрудника.
//// 
//// Параметры:
////  Сотрудник - СправочникСсылка.Сотрудники
//// 
//// Возвращаемое значение:
////  СправочникСсылка.ФизическиеЛица
////  
//Функция ФизЛицоСотрудника(Сотрудник) Экспорт
//	
//	Возврат Сотрудники.ФизЛицоСотрудника(Сотрудник);
//	
//КонецФункции

//// Возвращает физ лиц сотрудников.
//// 
//// Параметры:
////  МассивСотрудников
////   * СправочникСсылка.Сотрудники
//// 
//// Возвращаемое значение:
////  Массив
////   * СправочникСсылка.ФизическиеЛица
////
Функция ФизЛицаСотрудников(МассивСотрудников) Экспорт
	
	Возврат Сотрудники.ФизЛицаСотрудников(МассивСотрудников);
	
КонецФункции

//// Возвращает основного сотрудника для физ. лица.
////
//// Параметры:
////  ФизическоеЛицо - СправочникССылка.ФизическиеЛица
////
//// Возвращаемое значение:
////   СправочникССылка.Сотрудники
////
Функция ОсновнойСотрудникФизЛица(ФизическоеЛицо) Экспорт
		
	Возврат Сотрудники.ОсновнойСотрудникФизЛица(ФизическоеЛицо);
	
КонецФункции

//// Возвращает представление сотрудника.
////
//// Параметры:
////  ФизЛицо - СправочникСсылка.ФизическиеЛица, Строка - ссылка на физ. лицо или ФИО физ. лица.
////  ПредставлениеДолжностиПодразделения - Строка 
////  Должность - СправочникСсылка.Должности
////  Подразделение - СправочникСсылка.СтруктураПредприятия
////
//// Возвращаемое значение:
////  Строка
////
//Функция ПредставлениеСотрудника(Знач ФизЛицо, Знач ПредставлениеДолжностиПодразделения, 
//	Знач Должность = Неопределено, Знач Подразделение = Неопределено) Экспорт
//	
//	Возврат Сотрудники.ПредставлениеСотрудника(ФизЛицо, ПредставлениеДолжностиПодразделения, Должность, Подразделение);
//	
//КонецФункции

//#КонецОбласти