#Область ОписаниеПеременных
// Переменная Лексическое Окружениие Поля HTML
&НаКлиенте
Перем ЛексическоеОкруженииеПоля; 
#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПолеВыбораЦветаHTML = Центр_ВыборЦветаHTMLПовтИсп.ТекстОбщегоМакета("Центр_СтраницаВыбораЦветаHTML");	 
	ПолеВыбораЦветаHTML = СтрЗаменить(ПолеВыбораЦветаHTML, "initColorPickers();", ""); 
	
	Параметры.Свойство("Цвет", Цвет);
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ПолеВыбораЦветаДокументСформирован(Элемент)
	
	ЛексическоеОкруженииеПоля = Элементы.ПолеВыбораЦветаHTML.Документ.defaultView;
	ЛексическоеОкруженииеПоля.initColorPickers(Цвет); 
	
КонецПроцедуры

&НаКлиенте
Процедура ПолеВыбораЦветаПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	Цвет 	= ЛексическоеОкруженииеПоля.currentColorHEX;
	Красный = ЛексическоеОкруженииеПоля.currentColorRGB.R;
	Синий 	= ЛексическоеОкруженииеПоля.currentColorRGB.B;
	Зеленый = ЛексическоеОкруженииеПоля.currentColorRGB.G;    
	
	ЭтоКорректныйЦвет 				= ЛексическоеОкруженииеПоля.isCorrectColor; 
	Элементы.ФормаОК.Доступность 	= ЭтоКорректныйЦвет; 
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	ПараметрыЗакрытия = Новый Структура("ЦветHEX, ЦветRGB, ЦветТекстаRGB", Цвет, ЦветРГБ(), ЦветТекстаРГБ());
	Закрыть(ПараметрыЗакрытия);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция ЦветРГБ()

	Возврат Новый Структура("R, G, B", Красный, Зеленый, Синий);

КонецФункции

&НаКлиенте
Функция ЦветТекстаРГБ()

	ЦветТекстаРГБ = Новый Структура("R, G, B", 0, 0, 0);
	
	Попытка
		СтрокаРГБ = СтрЗаменить(СтрЗаменить(ЛексическоеОкруженииеПоля.color_input.style.color, "rgb(", ""), ")", "");  
		СтрокаРГБ = СтрЗаменить(СтрокаРГБ, " ", "");
		
		Если НРег(СтрокаРГБ) = "white" Тогда  
			СтрокаРГБ = "255,255,255";	
		Иначе
			СтрокаРГБ = "0,0,0";
		КонецЕсли;  
		
		МассивСтрокиРГБ = СтрРазделить(СтрокаРГБ, ",");    
		
		ЦветТекстаРГБ.Вставить("R", Число(МассивСтрокиРГБ[0]));      
		ЦветТекстаРГБ.Вставить("G", Число(МассивСтрокиРГБ[1]));
		ЦветТекстаРГБ.Вставить("B", Число(МассивСтрокиРГБ[2]));
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "";
		Сообщение.Сообщить();
	КонецПопытки; 
	
	Возврат ЦветТекстаРГБ;

КонецФункции

#КонецОбласти